// Доработка: Кряжев А., 2026
// Интерфейс двух используемых светодиодов платы v5.
// Рисунки задаются 16-битной маской с шагом 100 мс.
// Модуль хранит текущую фазу и рисунок, применяемый на ближайшем шаге.

#ifndef INDICATION_H
#define INDICATION_H

#include "includes.h"

#define LED_FL1		0x0001 /* одна вспышка*/
#define LED_FL2		0x0005
#define LED_ON		0xffff /* постоянно включен*/

// Вызывается из главного цикла раз в 100 мс.
void led_fun100ms (void);

// Загрузка начального значения в регистр светодиода
void led_load (Int8U led, Int16U val);

#endif
